stevenj/avr-libc3/include/avr/io/attiny26.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATtiny26.atdf                                              * 
 *   .ATDF File:   atdf/ATtiny26.atdf                                         * 
 *   Version:      2.0.10                                                     * 
 *   Date:         2019-04-25                                                 * 
 *   Device:       ATtiny26                                                   * 
 *   Architecture: AVR8                                                       * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.10 2019-04-25 :                                                      * 
 *        - Added missing TCB1 PORTMUX for tiny3217/3216/1617/1616/1614.      * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Corrected TC2 instance in ATtiny441.                              * 
 *        - Corrected defines for ATtiny1634.                                 * 
 *        - Refactored away family header files, now there is one header file * 
 *        - per device.                                                       * 
 *        - Corrected FUSE_MEMORY_SIZE for ATtiny4/5/9/10/20/40.              * 
 *        - Added simulator support for mega1609/1608/809/808.                * 
 *        - Succeeds Atmel.ATtiny_DFP 1.3.229.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATtiny26.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATtiny26_H_INCLUDED
#  define _AVR_ATtiny26_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define OSCCAL _SFR_MEM8 (0x51) /* Status Register */

#define MCUSR  _SFR_MEM8 (0x54) /* MCU Status register */
#define MCUCR  _SFR_MEM8 (0x55) /* MCU Control Register */

#define SP     _SFR_MEM8 (0x5D) /* Stack Pointer */

#define SREG   _SFR_MEM8 (0x5F) /* Status Register */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t LOW; 
    register8_t HIGH;
} FUSE_t;


/* Reset Disabled (Enable PB7 as i/o pin) */
typedef enum FUSE_RSTDISBL_enum
{
    FUSE_RSTDISBL_CLEAR_gc = (0x00), /* Reset Disabled (Enable PB7 as i/o pin) - CLEAR */
    FUSE_RSTDISBL_SET_gc   = (0x10), /* Reset Disabled (Enable PB7 as i/o pin) - SET */
} FUSE_RSTDISBL_t;

/* Serial program downloading (SPI) enabled */
typedef enum FUSE_SPIEN_enum
{
    FUSE_SPIEN_CLEAR_gc = (0x00), /* Serial program downloading (SPI) enabled - CLEAR */
    FUSE_SPIEN_SET_gc   = (0x08), /* Serial program downloading (SPI) enabled - SET */
} FUSE_SPIEN_t;

/* Preserve EEPROM through the Chip Erase cycle */
typedef enum FUSE_EESAVE_enum
{
    FUSE_EESAVE_CLEAR_gc = (0x00), /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
    FUSE_EESAVE_SET_gc   = (0x04), /* Preserve EEPROM through the Chip Erase cycle - SET */
} FUSE_EESAVE_t;

/* Brownout detector trigger level */
typedef enum FUSE_BODLEVEL_enum
{
    FUSE_BODLEVEL_4V0_gc = (0x00<<1), /* Brown-out detection at VCC=4.0 V */
    FUSE_BODLEVEL_2V7_gc = (0x01<<1), /* Brown-out detection at VCC=2.7 V */
} FUSE_BODLEVEL_t;

/* Brown-out detection enabled */
typedef enum FUSE_BODEN_enum
{
    FUSE_BODEN_CLEAR_gc = (0x00), /* Brown-out detection enabled - CLEAR */
    FUSE_BODEN_SET_gc   = (0x01), /* Brown-out detection enabled - SET */
} FUSE_BODEN_t;

/* CKOPT fuse (operation dependent of CKSEL fuses) */
typedef enum FUSE_CKOPT_enum
{
    FUSE_CKOPT_CLEAR_gc = (0x00), /* CKOPT fuse (operation dependent of CKSEL fuses) - CLEAR */
    FUSE_CKOPT_SET_gc   = (0x40), /* CKOPT fuse (operation dependent of CKSEL fuses) - SET */
} FUSE_CKOPT_t;

/* Select Clock Source */
typedef enum FUSE_PLLCK_SUT_CKSEL_enum
{
    FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_0MS_gc               = (0x01), /* PLL Clock; Start-up time: 1K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_4MS_gc               = (0x11), /* PLL Clock; Start-up time: 1K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_64MS_gc              = (0x21), /* PLL Clock; Start-up time: 1K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_PLLCLK_16KCK_64MS_gc             = (0x31), /* PLL Clock; Start-up time: 16K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_0MS_gc                = (0x80), /* Ext. Clock; Start-up time: 6 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_4MS_gc                = (0x90), /* Ext. Clock; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_64MS_gc               = (0xA0), /* Ext. Clock; Start-up time: 6 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_0MS_gc         = (0x81), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_4MS_gc         = (0x91), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_64MS_gc        = (0xA1), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_0MS_gc         = (0x82), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_4MS_gc         = (0x92), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_64MS_gc        = (0xA2), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_0MS_gc         = (0x83), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_4MS_gc         = (0x93), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_64MS_gc        = (0xA3), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_0MS_gc         = (0x84), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_4MS_gc         = (0x94), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_64MS_gc        = (0xA4), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_0MS_gc    = (0x85), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_4MS_gc    = (0x95), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_64MS_gc   = (0xA5), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_6CK_4MS_gc     = (0xB5), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_0MS_gc  = (0x86), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_4MS_gc  = (0x96), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_64MS_gc = (0xA6), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_6CK_4MS_gc   = (0xB6), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_0MS_gc   = (0x87), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_4MS_gc   = (0x97), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_64MS_gc  = (0xA7), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_6CK_4MS_gc    = (0xB7), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_0MS_gc  = (0x88), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_4MS_gc  = (0x98), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_64MS_gc = (0xA8), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_6CK_4MS_gc   = (0xB8), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_1KCK_4MS_gc           = (0x89), /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_1KCK_64MS_gc          = (0x99), /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_32KCK_64MS_gc         = (0xA9), /* Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_258CK_4MS_gc       = (0x8A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_258CK_64MS_gc      = (0x9A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_0MS_gc        = (0xAA), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_4MS_gc        = (0xBA), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_64MS_gc       = (0x8B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_0MS_gc       = (0x9B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_4MS_gc       = (0xAB), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_64MS_gc      = (0xBB), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_258CK_4MS_gc      = (0x8C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_258CK_64MS_gc     = (0x9C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_0MS_gc       = (0xAC), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_4MS_gc       = (0xBC), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_64MS_gc      = (0x8D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_0MS_gc      = (0x9D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_4MS_gc      = (0xAD), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_64MS_gc     = (0xBD), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_258CK_4MS_gc       = (0x8E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_258CK_64MS_gc      = (0x9E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_0MS_gc        = (0xAE), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_4MS_gc        = (0xBE), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_64MS_gc       = (0x8F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_0MS_gc       = (0x9F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_4MS_gc       = (0xAF), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_64MS_gc      = (0xBF), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms */
} FUSE_PLLCK_SUT_CKSEL_t;

