stevenj/avr-libc3/include/avr/io/attiny26.h
/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* Brown-out Reset Flag */
typedef enum CPU_BORF_enum
{
    CPU_BORF_CLEAR_gc = (0x00), /* Brown-out Reset Flag - CLEAR */
    CPU_BORF_SET_gc   = (0x04), /* Brown-out Reset Flag - SET */
} CPU_BORF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-On Reset Flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-On Reset Flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-On Reset Flag - SET */
} CPU_PORF_t;

/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[82]; /* RESERVED REGISTER BLOCK */
    register8_t TCNT0;        /* Timer Counter 0 */
    register8_t TCCR0;        /* Timer/Counter0 Control Register */
    register8_t rsv_0x54[4];  /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Timer/Counter Interrupt Flag register */
    register8_t TIMSK;        /* Timer/Counter Interrupt Mask Register */
} TC0_t;


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC1_struct
{
    register8_t rsv_0x00[73]; /* RESERVED REGISTER BLOCK */
    register8_t PLLCSR;       /* PLL Control and Status Register */
    register8_t rsv_0x4A;     /* RESERVED REGISTER */
    register8_t OCR1C;        /* Output Compare Register */
    register8_t OCR1B;        /* Output Compare Register */
    register8_t OCR1A;        /* Output Compare Register */
    register8_t TCNT1;        /* Timer/Counter Register */
    register8_t TCCR1B;       /* Timer/Counter Control Register B */
    register8_t TCCR1A;       /* Timer/Counter Control Register A */
    register8_t rsv_0x51[7];  /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Timer/Counter Interrupt Flag Register */
    register8_t TIMSK;        /* Timer/Counter Interrupt Mask Register */
} TC1_t;


/* Timer/Counter0 Overflow Interrupt Enable */
typedef enum TC0_TOIE0_enum
{
    TC0_TOIE0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
    TC0_TOIE0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Interrupt Enable - SET */
} TC0_TOIE0_t;

/* Timer/Counter0 Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Flag - SET */
} TC0_TOV0_t;

/* Prescaler Reset Timer/Counter0 */
typedef enum TC0_PSR0_enum
{
    TC0_PSR0_CLEAR_gc = (0x00), /* Prescaler Reset Timer/Counter0 - CLEAR */
    TC0_PSR0_SET_gc   = (0x08), /* Prescaler Reset Timer/Counter0 - SET */
} TC0_PSR0_t;

/* Clock Select0 bits */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Comparator A Output Mode Bits */
typedef enum TC1_COM1A_enum
{
    TC1_COM1A_VAL_0x00_gc = (0x00<<6), /* Disconnected from OCn/PWMn */
    TC1_COM1A_VAL_0x01_gc = (0x01<<6), /* Toggle OCn/PWMn output line */
    TC1_COM1A_VAL_0x02_gc = (0x02<<6), /* Clear OCn/PWMn output line */
    TC1_COM1A_VAL_0x03_gc = (0x03<<6), /* set OCn/PWMn output line */
} TC1_COM1A_t;

/* Comparator B Output Mode Bits */
typedef enum TC1_COM1B_enum
{
    TC1_COM1B_VAL_0x00_gc = (0x00<<4), /* Disconnected from OCn/PWMn */
    TC1_COM1B_VAL_0x01_gc = (0x01<<4), /* Toggle OCn/PWMn output line */
    TC1_COM1B_VAL_0x02_gc = (0x02<<4), /* Clear OCn/PWMn output line */
    TC1_COM1B_VAL_0x03_gc = (0x03<<4), /* set OCn/PWMn output line */
} TC1_COM1B_t;

/* Force Output Compare Match 1A */
typedef enum TC1_FOC1A_enum
{
    TC1_FOC1A_CLEAR_gc = (0x00), /* Force Output Compare Match 1A - CLEAR */
    TC1_FOC1A_SET_gc   = (0x08), /* Force Output Compare Match 1A - SET */
} TC1_FOC1A_t;

/* Force Output Compare Match 1B */
typedef enum TC1_FOC1B_enum
{
    TC1_FOC1B_CLEAR_gc = (0x00), /* Force Output Compare Match 1B - CLEAR */
    TC1_FOC1B_SET_gc   = (0x04), /* Force Output Compare Match 1B - SET */
} TC1_FOC1B_t;

/* Pulse Width Modulator A Enable */
typedef enum TC1_PWM1A_enum
{
    TC1_PWM1A_CLEAR_gc = (0x00), /* Pulse Width Modulator A Enable - CLEAR */
    TC1_PWM1A_SET_gc   = (0x02), /* Pulse Width Modulator A Enable - SET */
} TC1_PWM1A_t;

/* Pulse Width Modulator B Enable */
typedef enum TC1_PWM1B_enum
{
    TC1_PWM1B_CLEAR_gc = (0x00), /* Pulse Width Modulator B Enable - CLEAR */
    TC1_PWM1B_SET_gc   = (0x01), /* Pulse Width Modulator B Enable - SET */
} TC1_PWM1B_t;

/* Clear Timer/Counter on Compare Match */
typedef enum TC1_CTC1_enum
{
    TC1_CTC1_CLEAR_gc = (0x00), /* Clear Timer/Counter on Compare Match - CLEAR */
    TC1_CTC1_SET_gc   = (0x80), /* Clear Timer/Counter on Compare Match - SET */
} TC1_CTC1_t;

/* Prescaler Reset Timer/Counter1 */
typedef enum TC1_PSR1_enum
{
    TC1_PSR1_CLEAR_gc = (0x00), /* Prescaler Reset Timer/Counter1 - CLEAR */
    TC1_PSR1_SET_gc   = (0x40), /* Prescaler Reset Timer/Counter1 - SET */
} TC1_PSR1_t;

/* Clock Select Bits */
typedef enum TC1_CS1_enum
{
    TC1_CS1_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC1_CS1_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC1_CS1_VAL_0x02_gc = (0x02), /* Running, CLK/2 */
    TC1_CS1_VAL_0x03_gc = (0x03), /* Running, CLK/4 */
    TC1_CS1_VAL_0x04_gc = (0x04), /* Running, CLK/8 */
    TC1_CS1_VAL_0x05_gc = (0x05), /* Running, CLK/16 */
    TC1_CS1_VAL_0x06_gc = (0x06), /* Running, CLK/32 */
    TC1_CS1_VAL_0x07_gc = (0x07), /* Running, CLK/64 */
    TC1_CS1_VAL_0x08_gc = (0x08), /* Running, CLK/128 */
    TC1_CS1_VAL_0x09_gc = (0x09), /* Running, CLK/256 */
    TC1_CS1_VAL_0x0A_gc = (0x0A), /* Running, CLK/512 */
    TC1_CS1_VAL_0x0B_gc = (0x0B), /* Running, CLK/1024 */
    TC1_CS1_VAL_0x0C_gc = (0x0C), /* Running, CLK/2048 */
    TC1_CS1_VAL_0x0D_gc = (0x0D), /* Running, CLK/4096 */
    TC1_CS1_VAL_0x0E_gc = (0x0E), /* Running, CLK/8192 */
    TC1_CS1_VAL_0x0F_gc = (0x0F), /* Running, CLK/16384 */
} TC1_CS1_t;

/* Timer/Counter1 Output Compare Interrupt Enable */
typedef enum TC1_OCIE1A_enum
{
    TC1_OCIE1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
    TC1_OCIE1A_SET_gc   = (0x40), /* Timer/Counter1 Output Compare Interrupt Enable - SET */
} TC1_OCIE1A_t;

/* Timer/Counter1 Output Compare Interrupt Enable */
typedef enum TC1_OCIE1B_enum
{
    TC1_OCIE1B_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
    TC1_OCIE1B_SET_gc   = (0x20), /* Timer/Counter1 Output Compare Interrupt Enable - SET */
} TC1_OCIE1B_t;

/* Timer/Counter1 Overflow Interrupt Enable */
typedef enum TC1_TOIE1_enum
{
    TC1_TOIE1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
    TC1_TOIE1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Interrupt Enable - SET */
} TC1_TOIE1_t;

/* Timer/Counter1 Output Compare Flag 1A */
typedef enum TC1_OCF1A_enum
{
    TC1_OCF1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
    TC1_OCF1A_SET_gc   = (0x40), /* Timer/Counter1 Output Compare Flag 1A - SET */
} TC1_OCF1A_t;

/* Timer/Counter1 Output Compare Flag 1B */
typedef enum TC1_OCF1B_enum
{
    TC1_OCF1B_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1B - CLEAR */
    TC1_OCF1B_SET_gc   = (0x20), /* Timer/Counter1 Output Compare Flag 1B - SET */
} TC1_OCF1B_t;

/* Timer/Counter1 Overflow Flag */
typedef enum TC1_TOV1_enum
{
    TC1_TOV1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Flag - CLEAR */
    TC1_TOV1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Flag - SET */
} TC1_TOV1_t;

/* PCK Enable */
typedef enum TC1_PCKE_enum
{
    TC1_PCKE_CLEAR_gc = (0x00), /* PCK Enable - CLEAR */
    TC1_PCKE_SET_gc   = (0x04), /* PCK Enable - SET */
} TC1_PCKE_t;

/* PLL Enable */
typedef enum TC1_PLLE_enum
{
    TC1_PLLE_CLEAR_gc = (0x00), /* PLL Enable - CLEAR */
    TC1_PLLE_SET_gc   = (0x02), /* PLL Enable - SET */
} TC1_PLLE_t;

/* PLL Lock Detector */
typedef enum TC1_PLOCK_enum
{
    TC1_PLOCK_CLEAR_gc = (0x00), /* PLL Lock Detector - CLEAR */
    TC1_PLOCK_SET_gc   = (0x01), /* PLL Lock Detector - SET */
} TC1_PLOCK_t;

