stevenj/avr-libc3/include/avr/io/attiny26.h
/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[90]; /* RESERVED REGISTER BLOCK */
    register8_t GIFR;         /* General Interrupt Flag register */
    register8_t GIMSK;        /* General Interrupt Mask Register */
} EXINT_t;


/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x40), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x30)

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x40), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;

/* Pin Change Interrupt Flag */
typedef enum EXINT_PCIF_enum
{
    EXINT_PCIF_CLEAR_gc = (0x00), /* Pin Change Interrupt Flag - CLEAR */
    EXINT_PCIF_SET_gc   = (0x20), /* Pin Change Interrupt Flag - SET */
} EXINT_PCIF_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define ADC     (*(ADC_t *) 0x0000)     /* Analog-to-Digital Converter */
#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define USI     (*(USI_t *) 0x0000)     /* Universal Serial Interface */
#define PORTA   (*(PORTA_t *) 0x0000)   /* I/O Port */
#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define EEPROM  (*(EEPROM_t *) 0x0000)  /* EEPROM */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define TC1     (*(TC1_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* Reset Disabled (Enable PB7 as i/o pin) */
#define FUSE_RSTDISBL_CLEAR_gc (0x00) /* Reset Disabled (Enable PB7 as i/o pin) - CLEAR */
#define FUSE_RSTDISBL_SET_gc   (0x10) /* Reset Disabled (Enable PB7 as i/o pin) - SET */


/* Serial program downloading (SPI) enabled */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enabled - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x08) /* Serial program downloading (SPI) enabled - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x04) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Brownout detector trigger level */
#define FUSE_BODLEVEL_4V0_gc (0x00<<1) /* Brown-out detection at VCC=4.0 V */
#define FUSE_BODLEVEL_2V7_gc (0x01<<1) /* Brown-out detection at VCC=2.7 V */


/* Brown-out detection enabled */
#define FUSE_BODEN_CLEAR_gc (0x00) /* Brown-out detection enabled - CLEAR */
#define FUSE_BODEN_SET_gc   (0x01) /* Brown-out detection enabled - SET */


/* CKOPT fuse (operation dependent of CKSEL fuses) */
#define FUSE_CKOPT_CLEAR_gc (0x00) /* CKOPT fuse (operation dependent of CKSEL fuses) - CLEAR */
#define FUSE_CKOPT_SET_gc   (0x40) /* CKOPT fuse (operation dependent of CKSEL fuses) - SET */


/* Select Clock Source */
#define FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_0MS_gc               (0x01) /* PLL Clock; Start-up time: 1K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_4MS_gc               (0x11) /* PLL Clock; Start-up time: 1K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_PLLCLK_1KCK_64MS_gc              (0x21) /* PLL Clock; Start-up time: 1K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_PLLCLK_16KCK_64MS_gc             (0x31) /* PLL Clock; Start-up time: 16K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_0MS_gc                (0x80) /* Ext. Clock; Start-up time: 6 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_4MS_gc                (0x90) /* Ext. Clock; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTCLK_6CK_64MS_gc               (0xA0) /* Ext. Clock; Start-up time: 6 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_0MS_gc         (0x81) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_4MS_gc         (0x91) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_1MHZ_6CK_64MS_gc        (0xA1) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_0MS_gc         (0x82) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_4MS_gc         (0x92) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_2MHZ_6CK_64MS_gc        (0xA2) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_0MS_gc         (0x83) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_4MS_gc         (0x93) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_4MHZ_6CK_64MS_gc        (0xA3) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_0MS_gc         (0x84) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_4MS_gc         (0x94) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_INTRCOSC_8MHZ_6CK_64MS_gc        (0xA4) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_0MS_gc    (0x85) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_4MS_gc    (0x95) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_64MS_gc   (0xA5) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_6CK_4MS_gc     (0xB5) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_0MS_gc  (0x86) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_4MS_gc  (0x96) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_64MS_gc (0xA6) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_6CK_4MS_gc   (0xB6) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_0MS_gc   (0x87) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_4MS_gc   (0x97) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_64MS_gc  (0xA7) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_6CK_4MS_gc    (0xB7) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_0MS_gc  (0x88) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_4MS_gc  (0x98) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_64MS_gc (0xA8) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_6CK_4MS_gc   (0xB8) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_1KCK_4MS_gc           (0x89) /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_1KCK_64MS_gc          (0x99) /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTAL_32KCK_64MS_gc         (0xA9) /* Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_258CK_4MS_gc       (0x8A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_258CK_64MS_gc      (0x9A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_0MS_gc        (0xAA) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_4MS_gc        (0xBA) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_1KCK_64MS_gc       (0x8B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_0MS_gc       (0x9B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_4MS_gc       (0xAB) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTLOFXTALRES_16KCK_64MS_gc      (0xBB) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_258CK_4MS_gc      (0x8C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_258CK_64MS_gc     (0x9C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_0MS_gc       (0xAC) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_4MS_gc       (0xBC) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_1KCK_64MS_gc      (0x8D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_0MS_gc      (0x9D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_4MS_gc      (0xAD) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTMEDFXTALRES_16KCK_64MS_gc     (0xBD) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_258CK_4MS_gc       (0x8E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_258CK_64MS_gc      (0x9E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_0MS_gc        (0xAE) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_4MS_gc        (0xBE) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_1KCK_64MS_gc       (0x8F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_0MS_gc       (0x9F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_4MS_gc       (0xAF) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_PLLCK_SUT_CKSEL_EXTHIFXTALRES_16KCK_64MS_gc      (0xBF) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms */


