stevenj/avr-libc3/include/avr/io/attiny26.h
/* Force Output Compare Match 1B */
#define TC1_FOC1B_CLEAR_gc (0x00) /* Force Output Compare Match 1B - CLEAR */
#define TC1_FOC1B_SET_gc   (0x04) /* Force Output Compare Match 1B - SET */


/* Pulse Width Modulator A Enable */
#define TC1_PWM1A_CLEAR_gc (0x00) /* Pulse Width Modulator A Enable - CLEAR */
#define TC1_PWM1A_SET_gc   (0x02) /* Pulse Width Modulator A Enable - SET */


/* Pulse Width Modulator B Enable */
#define TC1_PWM1B_CLEAR_gc (0x00) /* Pulse Width Modulator B Enable - CLEAR */
#define TC1_PWM1B_SET_gc   (0x01) /* Pulse Width Modulator B Enable - SET */


/* Clear Timer/Counter on Compare Match */
#define TC1_CTC1_CLEAR_gc (0x00) /* Clear Timer/Counter on Compare Match - CLEAR */
#define TC1_CTC1_SET_gc   (0x80) /* Clear Timer/Counter on Compare Match - SET */


/* Prescaler Reset Timer/Counter1 */
#define TC1_PSR1_CLEAR_gc (0x00) /* Prescaler Reset Timer/Counter1 - CLEAR */
#define TC1_PSR1_SET_gc   (0x40) /* Prescaler Reset Timer/Counter1 - SET */


/* Clock Select Bits */
#define TC1_CS1_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC1_CS1_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC1_CS1_VAL_0x02_gc (0x02) /* Running, CLK/2 */
#define TC1_CS1_VAL_0x03_gc (0x03) /* Running, CLK/4 */
#define TC1_CS1_VAL_0x04_gc (0x04) /* Running, CLK/8 */
#define TC1_CS1_VAL_0x05_gc (0x05) /* Running, CLK/16 */
#define TC1_CS1_VAL_0x06_gc (0x06) /* Running, CLK/32 */
#define TC1_CS1_VAL_0x07_gc (0x07) /* Running, CLK/64 */
#define TC1_CS1_VAL_0x08_gc (0x08) /* Running, CLK/128 */
#define TC1_CS1_VAL_0x09_gc (0x09) /* Running, CLK/256 */
#define TC1_CS1_VAL_0x0A_gc (0x0A) /* Running, CLK/512 */
#define TC1_CS1_VAL_0x0B_gc (0x0B) /* Running, CLK/1024 */
#define TC1_CS1_VAL_0x0C_gc (0x0C) /* Running, CLK/2048 */
#define TC1_CS1_VAL_0x0D_gc (0x0D) /* Running, CLK/4096 */
#define TC1_CS1_VAL_0x0E_gc (0x0E) /* Running, CLK/8192 */
#define TC1_CS1_VAL_0x0F_gc (0x0F) /* Running, CLK/16384 */


/* Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1A_SET_gc   (0x40) /* Timer/Counter1 Output Compare Interrupt Enable - SET */


/* Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1B_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1B_SET_gc   (0x20) /* Timer/Counter1 Output Compare Interrupt Enable - SET */


/* Timer/Counter1 Overflow Interrupt Enable */
#define TC1_TOIE1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
#define TC1_TOIE1_SET_gc   (0x04) /* Timer/Counter1 Overflow Interrupt Enable - SET */


/* Timer/Counter1 Output Compare Flag 1A */
#define TC1_OCF1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
#define TC1_OCF1A_SET_gc   (0x40) /* Timer/Counter1 Output Compare Flag 1A - SET */


/* Timer/Counter1 Output Compare Flag 1B */
#define TC1_OCF1B_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1B - CLEAR */
#define TC1_OCF1B_SET_gc   (0x20) /* Timer/Counter1 Output Compare Flag 1B - SET */


/* Timer/Counter1 Overflow Flag */
#define TC1_TOV1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Flag - CLEAR */
#define TC1_TOV1_SET_gc   (0x04) /* Timer/Counter1 Overflow Flag - SET */


/* PCK Enable */
#define TC1_PCKE_CLEAR_gc (0x00) /* PCK Enable - CLEAR */
#define TC1_PCKE_SET_gc   (0x04) /* PCK Enable - SET */


/* PLL Enable */
#define TC1_PLLE_CLEAR_gc (0x00) /* PLL Enable - CLEAR */
#define TC1_PLLE_SET_gc   (0x02) /* PLL Enable - SET */


/* PLL Lock Detector */
#define TC1_PLOCK_CLEAR_gc (0x00) /* PLL Lock Detector - CLEAR */
#define TC1_PLOCK_SET_gc   (0x01) /* PLL Lock Detector - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x40) /* External Interrupt Request 0 Enable - SET */


/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x30)

/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x40) /* External Interrupt Flag 0 - SET */


/* Pin Change Interrupt Flag */
#define EXINT_PCIF_CLEAR_gc (0x00) /* Pin Change Interrupt Flag - CLEAR */
#define EXINT_PCIF_SET_gc   (0x20) /* Pin Change Interrupt Flag - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_ADC         _SFR_MEM16(0x0024) /* ADC Data Register  Bytes */
#define ADC_ADCL        _SFR_MEM8 (0x0024) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH        _SFR_MEM8 (0x0025) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSR       _SFR_MEM8 (0x0026) /* The ADC Control and Status register */
#define ADC_ADMUX       _SFR_MEM8 (0x0027) /* The ADC multiplexer Selection Register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSR         _SFR_MEM8 (0x0028) /* Analog Comparator Control And Status Register */

/* USI - Universal Serial Interface (0x0000) */
#define USI_BASE        _SFR_MEM8 (0x0000) /* USI Base Address */
#define USI_USICR       _SFR_MEM8 (0x002D) /* USI Control Register */
#define USI_USISR       _SFR_MEM8 (0x002E) /* USI Status Register */
#define USI_USIDR       _SFR_MEM8 (0x002F) /* USI Data Register */

