stevenj/avr-libc3/include/avr/io/attiny26.h
/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE     _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA     _SFR_MEM8 (0x0039) /* Port A Input Pins */
#define PORTAA_DDRA     _SFR_MEM8 (0x003A) /* Port A Data Direction Register */
#define PORTAA_PORTA    _SFR_MEM8 (0x003B) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0036) /* Port B Input Pins */
#define PORTBB_DDRB     _SFR_MEM8 (0x0037) /* Port B Data Direction Register */
#define PORTBB_PORTB    _SFR_MEM8 (0x0038) /* Port B Data Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE     _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR     _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR     _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR     _SFR_MEM8 (0x003E) /* EEPROM Read/Write Access */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR       _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_OSCCAL      _SFR_MEM8 (0x0051) /* Status Register */
#define CPU_MCUSR       _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP          _SFR_MEM8 (0x005D) /* Stack Pointer */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_TCNT0       _SFR_MEM8 (0x0052) /* Timer Counter 0 */
#define TC8_TCCR0       _SFR_MEM8 (0x0053) /* Timer/Counter0 Control Register */
#define TC8_TIFR        _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag register */
#define TC8_TIMSK       _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* TC1 - Timer/Counter, 8-bit (0x0000) */
/* TC8_BASE ALREADY DEFINED */
#define TC8_PLLCSR      _SFR_MEM8 (0x0049) /* PLL Control and Status Register */
#define TC8_OCR1C       _SFR_MEM8 (0x004B) /* Output Compare Register */
#define TC8_OCR1B       _SFR_MEM8 (0x004C) /* Output Compare Register */
#define TC8_OCR1A       _SFR_MEM8 (0x004D) /* Output Compare Register */
#define TC8_TCNT1       _SFR_MEM8 (0x004E) /* Timer/Counter Register */
#define TC8_TCCR1B      _SFR_MEM8 (0x004F) /* Timer/Counter Control Register B */
#define TC8_TCCR1A      _SFR_MEM8 (0x0050) /* Timer/Counter Control Register A */
/* TC8_TIFR ALREADY DEFINED */
/* TC8_TIMSK ALREADY DEFINED */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_GIFR      _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK     _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num       (0)                 
#define None_RESET_vect           _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num        (1)                 
#define None_INT0_vect            _VECTOR(1)          /* External Interrupt 0 */
#define None_IO_PINS_vect_num     (2)                 
#define None_IO_PINS_vect         _VECTOR(2)          /* External Interrupt Request 0 */
#define None_TIMER1_CMPA_vect_num (3)                 
#define None_TIMER1_CMPA_vect     _VECTOR(3)          /* Timer/Counter1 Compare Match 1A */
#define None_TIMER1_CMPB_vect_num (4)                 
#define None_TIMER1_CMPB_vect     _VECTOR(4)          /* Timer/Counter1 Compare Match 1B */
#define None_TIMER1_OVF1_vect_num (5)                 
#define None_TIMER1_OVF1_vect     _VECTOR(5)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF0_vect_num (6)                 
#define None_TIMER0_OVF0_vect     _VECTOR(6)          /* Timer/Counter0 Overflow */
#define None_USI_STRT_vect_num    (7)                 
#define None_USI_STRT_vect        _VECTOR(7)          /* USI Start */
#define None_USI_OVF_vect_num     (8)                 
#define None_USI_OVF_vect         _VECTOR(8)          /* USI Overflow */
#define None_EE_RDY_vect_num      (9)                 
#define None_EE_RDY_vect          _VECTOR(9)          /* EEPROM Ready */
#define None_ANA_COMP_vect_num    (10)                
#define None_ANA_COMP_vect        _VECTOR(10)         /* Analog Comparator */
#define None_ADC_vect_num         (11)                
#define None_ADC_vect             _VECTOR(11)         /* ADC Conversion Complete */

/* Vector Table Size */
#define _VECTOR_SIZE              (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE             (12 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0800)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x0800)                           
#define FLASH_PAGE_SIZE (0x0020)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0002)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

